# ViewOrganizationId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InSessionViewSheetSet..::..ViewOrganizationId Property
InSessionViewSheetSet Class See Also
---
ElementId to the BrowserOrganization for non-sheet views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ElementId ViewOrganizationId { get; set; }
```

Visual Basic
---
```text
Public Overridable Property ViewOrganizationId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
virtual property ElementId^ ViewOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Implements
IViewSheetSet..::..ViewOrganizationId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible. |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace